vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1189_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT1189_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT1189</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.09.00-pvw2" date="2025-08-12">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw2</release>
    <release version="25.09.00-pvw1" date="2025-07-14">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00-pvw1</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.06.00-pvw2" date="2025-05-19">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00-pvw2</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-02-07">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT1189" Dvendor="NXP:11">
      <description>i.MX RT1180</description>
      <device Dname="MIMXRT1189xxxxx">
        <processor Pname="cm33" Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="240000000"/>
        <processor Pname="cm7" Dcore="Cortex-M7" Dfpu="DP_FPU" Dmpu="MPU" Dtz="NO_TZ" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="800000000"/>
        <environment Pname="cm33" name="iar">
          <file category="linkerfile" name="devices/MIMXRT1189/iar/MIMXRT1189xxxxx_cm33_ram.icf"/>
        </environment>
        <environment Pname="cm7" name="iar">
          <file category="linkerfile" name="devices/MIMXRT1189/iar/MIMXRT1189xxxxx_cm7_ram.icf"/>
        </environment>
        <sequences>
          <sequence name="ShowReg">
            <block>
              __var SI_VER_ADDR     = 0x5751804C;
              __var SCB_AIRCR_ADDR  = 0xE000ED0C;
              __var DCB_DHCSR_ADDR  = 0xE000EDF0;
              __var DCB_DEMCR_ADDR  = 0xE000EDFC;
              __var DWT_COMP0_ADDR  = 0xE0001020;
              __var DWT_FUNC0_ADDR  = 0xE0001028;
              __var SRC_SRSR_ADDR   = 0x44460050;
              __var SRC_SRMASK_ADDR = 0x54460018;
              __var SRC_AUTHEN_CTRL_ADDR = 0x44460004;
              
              __var r;
              __var debug = 0;
            </block>
            <control if="(debug == 1)">
              <block>
                r = Read32(SCB_AIRCR_ADDR);
                Message(0, "    SCB_AIRCR_ADDR = %x", r);
                r = Read32(DCB_DHCSR_ADDR);
                Message(0, "    DCB_DHCSR_ADDR = %x", r);
                r = Read32(DCB_DEMCR_ADDR);
                Message(0, "    DCB_DEMCR_ADDR = %x", r);
                
                r = Read32(DWT_COMP0_ADDR);
                Message(0, "    DWT_COMP0_ADDR = %x", r);
                r = Read32(DWT_FUNC0_ADDR);
                Message(0, "    DWT_FUNC0_ADDR = %x", r);
                
                r = Read32(SRC_SRSR_ADDR);
                Message(0, "    SRC_SRSR_ADDR = %x", r);
                r = Read32(SRC_SRMASK_ADDR);
                Message(0, "    SRC_SRMASK_ADDR = %x", r);
                r = Read32(SRC_AUTHEN_CTRL_ADDR);
                Message(0, "    SRC_AUTHEN_CTRL_ADDR = %x", r);
              </block>
            </control>
          </sequence>
          <sequence Pname="cm7" name="ResetSystem">
            <block>
              __var SI_VER_ADDR     = 0x5751804C;
              __var SCB_AIRCR_ADDR  = 0xE000ED0C;
              __var DCB_DHCSR_ADDR  = 0xE000EDF0;
              __var DCB_DEMCR_ADDR  = 0xE000EDFC;
              __var DWT_COMP0_ADDR  = 0xE0001020;
              __var DWT_FUNC0_ADDR  = 0xE0001028;
              __var SRC_SRSR_ADDR   = 0x44460050;
              __var SRC_SRMASK_ADDR = 0x54460018;
              __var SRC_AUTHEN_CTRL_ADDR = 0x44460004;
              
              __var r;
              __var w;
              __var comp0;
              __var func0;
              __var core_reset_request_bit_mask;
              __var rom_trap_addr;
              __var mem_0;
              __var mem_1;
              __var mem_2;
              
              Message(0, "Step in CM7 ResetSystem");
            </block>
            <block>
              r = Read32(SI_VER_ADDR) &amp; 0xF;
              rom_trap_addr = 0x10002932;
            </block>
            <control if="(r == 1)">
              <block>rom_trap_addr = 0x100025D4;</block>
            </control>
            <control if="(r == 2)">
              <block>rom_trap_addr = 0x100025D4;</block>
            </control>
            <block>Message(0, "  Ver = %x, trap_addr = 0x%x", r, rom_trap_addr);</block>
            <block>
              // Halt the CPU and wait sometime for possible peripheral operation finish
              Write32(DCB_DHCSR_ADDR, 0xA05F0003);
              DAP_Delay(10000);
              r = Read32(DCB_DHCSR_ADDR) &amp; 0x2;
            </block>
            <control if="(r == 0)">
              <block>Message(0, "  ERR: CM7 core can't be halted!");</block>
            </control>
            <block>Sequence("ShowReg");</block>
            <block>
              // check and enable core request system reset
              core_reset_request_bit_mask = 0x400;  // for CM7 core
              r = Read32(SRC_SRMASK_ADDR);
            </block>
            <control if="(r &amp; core_reset_request_bit_mask) != 0">
              <control if="(r &amp; (core_reset_request_bit_mask &lt;&lt; 16)) != 0">
                <block>Message(0, "  ERR: Core reset request is masked and locked!");</block>
              </control>
              <control if="(r &amp; (core_reset_request_bit_mask &lt;&lt; 16)) == 0">
                <block>
                  w = r &amp; (~core_reset_request_bit_mask);
                  r = Read32(SRC_AUTHEN_CTRL_ADDR);
                </block>
                <control if="(r &amp; 0x80) == 0">
                  <block>
                    Message(0, "  Enable system reset via CM7 core reset");
                    Write32(SRC_SRMASK_ADDR, w);
                  </block>
                </control>
                <control if="(r &amp; 0x80) != 0">
                  <block>Message(0, "  ERR: Core reset request is masked and all mask are locked!");</block>
                </control>
              </control>
            </control>
            <block>Sequence("ShowReg");</block>
            <block>
              __ap = 3;  // switch to CM33 AP port
              
              Message(0, "  Set CM33 watch point");
              Write32(DCB_DHCSR_ADDR, 0xA05F0003);    // Enable Debug and halt CM33 core
              comp0 = Read32(DWT_COMP0_ADDR);         // Save the DWT register and restore them later
              func0 = Read32(DWT_FUNC0_ADDR);
              Write32(DCB_DEMCR_ADDR, 0x01000000);    // Enable DWT of CM33 core
              Write32(DWT_COMP0_ADDR, rom_trap_addr);
              Write32(DWT_FUNC0_ADDR, 0x00000412);
              
