vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1189_DFP.pdsc
              __ap = 2;  // switch back to CM7 AP port
              
              // Clear the reset status to avoid ROM clean the core TCM after reset
              r = Read32(SRC_SRSR_ADDR);
              Write32(SRC_SRSR_ADDR, r);
            </block>
            <block>Sequence("ShowReg");</block>
            <block>
              // Sequence KickOffCM7 will use the first 3 words(32bits) of CM7 ITCM, save and restore them later
              mem_0 = Read32(0);
              mem_1 = Read32(4);
              mem_2 = Read32(8);
            </block>
            <block>
              Message(0, "  Execute SYSRESETREQ via AIRCR");
              Write32(SCB_AIRCR_ADDR, 0x05FA0004);
              DAP_Delay(100000);
            </block>
            <block>
              __ap = 3;  // switch to CM33 AP port
              r = Read32(DWT_FUNC0_ADDR);
              __ap = 2;  // switch back to CM7 AP port
            </block>
            <control if="(r &amp; 0x01000000) == 0">
              <block>Message(0, "  ERR: CM33 core is not trapped!");</block>
            </control>
            <control if="(r &amp; 0x01000000) != 0">
              <block>Message(0, "  CM33 core is trapped after system reset!");</block>
            </control>
            <block>
              Sequence("KickOffCM7");
              
              // Halt CM7 core
              Write32(DCB_DHCSR_ADDR, 0xA05F0003);
              DAP_Delay(10000);
            </block>
            <block>Sequence("ShowReg");</block>
            <block>r = Read32(DCB_DHCSR_ADDR) &amp; 0x2;</block>
            <control if="(r != 0)">
              <block>
                Message(0, "  Restore CM7 ITCM");
                Write32(0, mem_0);
                Write32(4, mem_1);
                Write32(8, mem_2);
                
                __ap = 3;  // switch to CM33 AP port
                Message(0, "  Restore CM33 watch point");
                Write32(DWT_COMP0_ADDR, comp0);
                Write32(DWT_FUNC0_ADDR, func0);
                __ap = 2;  // switch back to CM7 AP port
              </block>
            </control>
            <control if="(r == 0)">
              <block>Message(0, "  ERR: CM7 core can not be halted after reset!");</block>
            </control>
            <block>Message(0, "Step out CM7 ResetSystem");</block>
          </sequence>
          <sequence Pname="cm33" name="ResetSystem">
            <block>
              __var SI_VER_ADDR     = 0x5751804C;
              __var SCB_AIRCR_ADDR  = 0xE000ED0C;
              __var DCB_DHCSR_ADDR  = 0xE000EDF0;
              __var DCB_DCRSR_ADDR  = 0xE000EDF4;
              __var DCB_DCRDR_ADDR  = 0xE000EDF8;
              __var DCB_DEMCR_ADDR  = 0xE000EDFC;
              __var DWT_COMP0_ADDR  = 0xE0001020;
              __var DWT_FUNC0_ADDR  = 0xE0001028;
              __var SRC_SRSR_ADDR   = 0x44460050;
              __var SRC_SRMASK_ADDR = 0x54460018;
              __var SRC_AUTHEN_CTRL_ADDR = 0x44460004;
              
              __var r;
              __var w;
              __var comp0;
              __var func0;
              __var core_reset_request_bit_mask;
              __var rom_trap_addr;
              
              Message(0, "Step in CM33 ResetSystem");
            </block>
            <block>
              r = Read32(SI_VER_ADDR) &amp; 0xF;
              rom_trap_addr = 0x10002932;
            </block>
            <control if="(r == 1)">
              <block>rom_trap_addr = 0x100025D4;</block>
            </control>
            <control if="(r == 2)">
              <block>rom_trap_addr = 0x100025D4;</block>
            </control>
            <block>Message(0, "  Ver = %x, trap_addr = 0x%x", r, rom_trap_addr);</block>
            <block>
              // Halt the CPU and wait sometime for possible peripheral operation finish
              Write32(DCB_DHCSR_ADDR, 0xA05F0003);
              DAP_Delay(10000);
              r = Read32(DCB_DHCSR_ADDR) &amp; 0x2;
            </block>
            <control if="(r == 0)">
              <block>Message(0, "  ERR: CM33 core can't be halted!");</block>
            </control>
            <block>Sequence("ShowReg");</block>
            <block>
              // check and enable core request system reset
              core_reset_request_bit_mask = 0x100;  // for CM33 core
              r = Read32(SRC_SRMASK_ADDR);
            </block>
            <control if="(r &amp; core_reset_request_bit_mask) != 0">
              <control if="(r &amp; (core_reset_request_bit_mask &lt;&lt; 16)) != 0">
                <block>Message(0, "  ERR: Core reset request is masked and locked!");</block>
              </control>
              <control if="(r &amp; (core_reset_request_bit_mask &lt;&lt; 16)) == 0">
                <block>
                  w = r &amp; (~core_reset_request_bit_mask);
                  r = Read32(SRC_AUTHEN_CTRL_ADDR);
                </block>
                <control if="(r &amp; 0x80) == 0">
                  <block>
                    Message(0, "  Enable system reset via CM33 core reset");
                    Write32(SRC_SRMASK_ADDR, w);
                  </block>
                </control>
                <control if="(r &amp; 0x80) != 0">
                  <block>Message(0, "  ERR: Core reset request is masked and all mask are locked!");</block>
                </control>
              </control>
            </control>
            <block>Sequence("ShowReg");</block>
            <block>
              Message(0, "  Set CM33 watch point");
              comp0 = Read32(DWT_COMP0_ADDR); // Save the DWT register and restore them later
              func0 = Read32(DWT_FUNC0_ADDR);
              Write32(DCB_DEMCR_ADDR, 0x01000000);    // Enable DWT of CM33 core
              Write32(DWT_COMP0_ADDR, rom_trap_addr);
              Write32(DWT_FUNC0_ADDR, 0x00000412);
              
              // Clear the reset status to avoid ROM clean the core TCM after reset
              r = Read32(SRC_SRSR_ADDR);
              Write32(SRC_SRSR_ADDR, r);
            </block>
            <block>Sequence("ShowReg");</block>
            <block>
              Message(0, "  Execute SYSRESETREQ via AIRCR");
              Write32(SCB_AIRCR_ADDR, 0x05FA0004);
              DAP_Delay(100000);
            </block>
            <block>Sequence("ShowReg");</block>
            <block>r = Read32(DWT_FUNC0_ADDR);</block>
            <control if="(r &amp; 0x01000000) == 0">
              <block>Message(0, "  ERR: CM33 core is not trapped!");</block>
            </control>
            <control if="(r &amp; 0x01000000) != 0">
              <block>Message(0, "  CM33 core is trapped after system reset!");</block>
            </control>
            <block>r = Read32(DCB_DHCSR_ADDR) &amp; 0x2;</block>
            <control if="r != 0">
              <block>
                Message(0, "  Restore CM33 watch point");
                Write32(DWT_COMP0_ADDR, comp0);
                Write32(DWT_FUNC0_ADDR, func0);
              </block>
            </control>
            <control if="r == 0">
              <block>Message(0, "  ERR: CM33 is not halted after reset!");</block>
            </control>
            <block>
              // Write SPLIM as 0 before exit
              Write32(DCB_DCRDR_ADDR, 0x0);
              Write32(DCB_DCRSR_ADDR, 0x1001C);
              Message(0, "Step out CM33 ResetSystem");
            </block>
          </sequence>
          <sequence Pname="cm33" name="HaltCM33">
            <block>
    </block>
          </sequence>
          <sequence Pname="cm7" name="HaltCM33">
            <block>
              __var CM33_DHCSR_F = 0;
              __var CM33_DHCSR_S = 0;
              __var boot_mode = 0;
              
              // switch to CM33 AP port first
              __dp = 0;
              __ap = 3;
              
              boot_mode = (Read32(0x54460044) &gt;&gt; 24) &amp; 0x3F;  //SRC.SBMR2
            </block>
            <control if="(boot_mode == 8) || (boot_mode == 9)">
              <block>
                Message(0, "Boot from fuse or serial download mode, check if CM33 is halted...");
                CM33_DHCSR_F = Read32(0xE000EDF0);  //DHCSR
              </block>
              <control if="(CM33_DHCSR_F &amp; 0x02) == 0">
                <block>
                  Message(0, "CM33 is not halted, trying to halt it. CM33 DHCSR = 0x%x", CM33_DHCSR_F);
                  Write32(0xE000EDF0, 0xA05F0001);   // DHCSR, Enable CM33 debug control
                  Write32(0xE000EDF0, 0xA05F0003);   // DHCSR, Halt CM33
                  CM33_DHCSR_S = Read32(0xE000EDF0);  //DHCSR
                </block>
                <control if="(CM33_DHCSR_S &amp; 0x02) != 0">
                  <block>Message(0, "CM33 is halted now. CM33 DHCSR = 0x%x", CM33_DHCSR_S);</block>
                </control>
                <control if="(CM33_DHCSR_S &amp; 0x02) == 0">
                  <block>
                    Message(0, "CM33 is still running, halt failed. CM33 DHCSR = 0x%x", CM33_DHCSR_S);
                  </block>
                </control>
              </control>
              <control if="(CM33_DHCSR_F &amp; 0x02) != 0">
                <block>Message(0, "CM33 is halted already. CM33 DHCSR = 0x%x", CM33_DHCSR_F);</block>
              </control>
            </control>
            <control if="(boot_mode != 8) &amp;&amp; (boot_mode != 9)">
              <block>Message(0, "Flash execution mode, leave CM33 run status as it was...");</block>
            </control>
            <block>
      // switch back to CM7 AP port
      __ap = 2;
    </block>
          </sequence>
          <sequence name="InitCM7TCM">
            <block>
              __var reg = 0;
              __var targetAddr = 0;
              
              __ap = 3;
              
              // DMA channel is active, wait it get finished
              reg = Read32(0x52010000);         // DMA4.TDC[0].CH_CSR
            </block>
            <control if="(reg &amp; 0x80000000) != 0">
              <control while="(Read32(0x52010000) &amp; 0x40000000) == 0" timeout="1000000"/>
            </control>
            <block>
              targetAddr = 0x303C0000;
              Write32(0x52010000, 0x40000000);    // DMA4.TDC[0].CH_CSR, clear DONE flag
              
