vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1189_DFP.pdsc
                Message(0, "  CM7 is kicked-off");
              </block>
            </control>
            <block>
      // switch back to CM7 AP port
      __ap = 2;
    </block>
          </sequence>
          <sequence name="DebugPortStart">
            <block>
              __var SW_DP_ABORT  = 0x0;
              __var DP_CTRL_STAT = 0x4;
              __var DP_SELECT    = 0x8;
              __var powered_down = 0;
              // Switch to DP Register Bank 0
              WriteDP(DP_SELECT, 0x00000000);
              // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
              powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
            </block>
            <control if="powered_down">
              <block>
                // Request Debug/System Power-Up
                WriteDP(DP_CTRL_STAT, 0x50000000);
              </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- JTAG Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 1">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                  WriteDP(DP_CTRL_STAT, 0x50000F32);
                </block>
              </control>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
                  // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                  WriteDP(DP_CTRL_STAT, 0x50000F00);
                  
                  // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                  WriteDP(SW_DP_ABORT, 0x0000001E);
                </block>
              </control>
            </control>
            <block>
       Sequence("HaltCM33");
       Sequence("StartCM7");
    </block>
          </sequence>
        </sequences>
        <memory name="ROMCP" start="0x00000000" size="0x028000" access="rx" default="1"/>
        <memory name="SRAM_OC1" start="0x20484000" size="0x07c000" access="rw" default="1"/>
        <memory name="SRAM_OC2" start="0x20500000" size="0x040000" access="rw" default="1"/>
        <algorithm name="devices/MIMXRT1189/arm/MIMXRT1180_EVK_FSPI1_QSPI_CM33.FLM" start="0x28000000" size="0x1000000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
        <algorithm name="devices/MIMXRT1189/arm/MIMXRT1180_EVK_FSPI1_QSPI_CM7.FLM" start="0x28000000" size="0x1000000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
        <debug svd="devices/MIMXRT1189/MIMXRT1189_cm33.xml" Pname="cm33" __dp="0" __ap="3"/>
        <debug svd="devices/MIMXRT1189/MIMXRT1189_cm7.xml" Pname="cm7" __dp="0" __ap="2"/>
        <variant Dvariant="MIMXRT1189CVM8B">
          <compile Pname="cm33" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189CVM8B_cm33"/>
          <compile Pname="cm7" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189CVM8B_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1189XVM8B">
          <compile Pname="cm33" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189XVM8B_cm33"/>
          <compile Pname="cm7" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189XVM8B_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1189CVM8C">
          <compile Pname="cm33" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189CVM8C_cm33"/>
          <compile Pname="cm7" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189CVM8C_cm7"/>
        </variant>
        <variant Dvariant="MIMXRT1189XVM8C">
          <compile Pname="cm33" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189XVM8C_cm33"/>
          <compile Pname="cm7" header="devices/MIMXRT1189/fsl_device_registers.h" define="CPU_MIMXRT1189XVM8C_cm7"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT1189.internal_condition">
      <accept Dname="MIMXRT1189CVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1189CVM8C" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1189XVM8B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1189XVM8C" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.device=MIMXRT1189.internal_condition">
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.sai_edma, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai_edma, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
