vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1189_DFP.pdsc
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_uart, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_uart, device=MIMXRT1189.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.flexspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexspi, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexspi, device=MIMXRT1189.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_flr.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.gpc_3.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.gpt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.i3c_edma.condition_id">
      <require condition="allOf.driver.edma4, driver.i3c, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, driver.i3c, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.iee.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.iee_apc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.iomuxc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.kpp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpi2c, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpi2c, device=MIMXRT1189.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.lpit.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpspi, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpspi, device=MIMXRT1189.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpuart, device=MIMXRT1189.internal_condition"/>
    </condition>
