vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1189_DFP.pdsc
    <condition id="driver.trdc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.tstmr.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.usdhc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.vref_1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.wm8524.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8524_adapter, driver.codec, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8524_adapter, driver.codec, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.wm8904.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8904_adapter, driver.codec, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.wm8960.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8960_adapter, driver.codec, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.wm8962.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.wm8962_adapter, driver.codec, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.wm8962_adapter, driver.codec, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="driver.xbar_1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1189xxxxx.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk, cores=cm33, cm7f.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
      <require condition="cores.cm33, cm7f.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.driver.common, utility.debug_console, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.debug_console, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MIMXRT1189.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="not.utility.assert.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT1189.internal_condition"/>
    </condition>
    <condition id="not.utility.assert.internal_condition">
      <deny Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, utility.str, device=MIMXRT1189.internal_condition"/>
    </condition>
