vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1189_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ele_base_api" Cversion="1.0.0" condition="driver.ele_base_api.condition_id">
      <description>ELE Base API Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_ele_base_api.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_ele_base_api.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eqdc" Cversion="2.3.1" condition="driver.eqdc.condition_id">
      <description>EQDC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_eqdc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_eqdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ewm" Cversion="2.0.4" condition="driver.ewm.condition_id">
      <description>EWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_ewm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_ewm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan" Cversion="2.14.4" condition="driver.flexcan.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexcan.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexcan.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan_edma" Cversion="2.12.1" condition="driver.flexcan_edma.condition_id">
      <description>FLEXCAN Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexcan_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexcan_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.3.0" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_a-format" Cversion="1.0.0" condition="driver.flexio_a-format.condition_id">
      <description>FLEXIO A-format Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio_a-format.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio_a-format.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.6.2" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.1" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s_edma" Cversion="2.1.8" condition="driver.flexio_i2s_edma.condition_id">
      <description>FLEXIO I2S EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio_i2s_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio_i2s_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.4.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_edma" Cversion="2.3.0" condition="driver.flexio_spi_edma.condition_id">
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1189/drivers/fsl_flexio_spi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1189/drivers/fsl_flexio_spi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1189/drivers/"/>
      </files>
    </component>
